import pytest

from src.services import get_search


@pytest.fixture
def transactions():
    return [
        {
            "Дата операции": "03.01.2018 14:55:21",
            "Номер карты": "1234567890123456",
            "Сумма операции": -100,
            "Бонусы (включая кэшбэк)": 1,
            "Категория": "Category 1",
            "Описание": "Transaction 1",
            "Статус": "OK",
        },
        {
            "Дата операции": "01.01.2018 20:27:51",
            "Номер карты": "1234567890123456",
            "Сумма операции": -200,
            "Бонусы (включая кэшбэк)": 2,
            "Категория": "Category 2",
            "Описание": "Transaction 2",
            "Статус": "OK",
        },
        {
            "Дата операции": "02.01.2018 20:27:51",
            "Номер карты": "9876543210987654",
            "Сумма операции": -150,
            "Бонусы (включая кэшбэк)": 3,
            "Категория": "Category 1",
            "Описание": "Transaction 3",
            "Статус": "OK",
        },
        {
            "Дата операции": "04.11.2018 17:27:51",
            "Номер карты": "9876543210987654",
            "Сумма операции": -50,
            "Бонусы (включая кэшбэк)": 1,
            "Категория": "Category 3",
            "Описание": "Transaction 4",
            "Статус": "OK",
        },
    ]


def test_get_search(transactions):
    assert type(get_search(transactions, "Transaction 2")) == str
